# Brewfile - Package manifest for Homebrew
# This file can be used to restore all packages on a new machine
# Usage: brew bundle --file=Brewfile

# Taps (Third-party repositories)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Command Line Tools
brew "coreutils"           # GNU core utilities
brew "findutils"          # GNU find, xargs, locate
brew "gnu-tar"            # GNU version of tar
brew "gnu-sed"            # GNU version of sed
brew "gawk"               # GNU awk
brew "gnutls"             # GNU TLS
brew "gnu-getopt"         # GNU getopt
brew "grep"               # GNU grep
brew "wget"               # Internet file retriever
brew "curl"               # Transfer data with URLs
brew "git"                # Version control
brew "git-lfs"            # Git Large File Storage
brew "gh"                 # GitHub CLI
brew "jq"                 # JSON processor
brew "yq"                 # YAML processor
brew "tree"               # Display directories as trees
brew "htop"               # Interactive process viewer
brew "ncdu"               # NCurses disk usage
brew "ripgrep"            # Fast grep alternative
brew "fd"                 # Fast find alternative
brew "fzf"                # Fuzzy finder
brew "bat"                # Cat with syntax highlighting
brew "exa"                # Modern ls replacement
brew "tmux"               # Terminal multiplexer
brew "neovim"             # Modern Vim
brew "stow"               # Symlink manager

# Development Tools
brew "python@3.12"        # Python 3.12
brew "python@3.11"        # Python 3.11
brew "pipx"               # Install Python apps in isolated environments
brew "go"                 # Go programming language
brew "node"               # Node.js (if not using nvm)
brew "nvm"                # Node Version Manager
brew "yarn"               # JavaScript package manager
brew "maven"              # Java build tool
brew "gradle"             # Java build tool
brew "ant"                # Java build tool
brew "jenv"               # Java environment manager

# Database Tools
brew "postgresql@16"      # PostgreSQL database
brew "mysql"              # MySQL database
brew "redis"              # Redis key-value store
brew "neo4j"              # Neo4j graph database
brew "mongodb-community"  # MongoDB NoSQL database

# Cloud and DevOps Tools
brew "awscli"             # AWS Command Line Interface
brew "aws-sam-cli"        # AWS SAM CLI
brew "azure-cli"          # Azure CLI
brew "terraform"          # Infrastructure as Code
brew "terragrunt"         # Terraform wrapper
brew "ansible"            # Automation tool
brew "packer"             # Image builder
brew "kubectl"            # Kubernetes CLI
brew "kubectx"            # Switch between kubectl contexts
brew "kubernetes-cli"     # Kubernetes command-line tool
brew "helm"               # Kubernetes package manager
brew "minikube"           # Local Kubernetes
brew "kind"               # Kubernetes in Docker
brew "k9s"                # Kubernetes CLI dashboard
brew "podman"             # Container management
brew "buildah"            # Build OCI images
brew "skopeo"             # Work with remote images

# Additional Tools
brew "git-delta"          # Better git diffs
brew "direnv"             # Environment switcher
brew "watchman"           # File watching service

# Cask Applications (GUI Apps)
cask "cursor"             # AI-powered code editor
cask "warp"               # Modern terminal
cask "visual-studio-code" # Code editor
cask "iterm2"             # Terminal emulator
cask "docker"             # Container platform
cask "postman"            # API development
cask "insomnia"           # REST client
cask "tableplus"          # Database GUI
cask "dbeaver-community"  # Universal database tool
cask "mongodb-compass"    # MongoDB GUI
cask "redis-insight"      # Redis GUI
cask "neo4j"              # Neo4j Desktop
cask "rectangle"          # Window management
cask "alfred"             # Productivity app
cask "raycast"            # Launcher and productivity

# Fonts (for terminal and coding)
cask "font-jetbrains-mono"        # JetBrains Mono font
cask "font-fira-code"             # Fira Code font
cask "font-cascadia-code"         # Cascadia Code font
cask "font-meslo-lg-nerd-font"    # Nerd Font for Powerlevel10k

# Optional: Mac App Store apps (requires mas CLI)
# mas "Xcode", id: 497799835
# mas "Slack", id: 803453959

# Java Development Kits
cask "temurin@21"         # OpenJDK 21
cask "temurin@17"         # OpenJDK 17
cask "temurin@11"         # OpenJDK 11

# Cloud Platform Tools
cask "google-cloud-sdk"   # Google Cloud SDK

# Additional Development Tools
cask "sublime-text"       # Text editor
cask "jetbrains-toolbox"  # JetBrains IDE manager
cask "slack"              # Team communication
cask "zoom"               # Video conferencing
cask "notion"             # Note-taking and organization
cask "obsidian"           # Knowledge management
